# 입력받기
N, M = map(int, input().split())
ground = []

for _ in range(N):
    line = list(map(int, input().split()))
    ground.append(line)

# =============================
# 완전탐색 문제

# 모든 테트로미노의 제일 초기 위치 [(). (), (), (), 가로길이, 세로길이]
tet_list = [[(0, 0), (0, 1), (0, 2), (0, 3), 4, 1],
                 [(0, 0), (1, 0), (2, 0), (3, 0), 1, 4],
                 [(0, 0), (0, 1), (1, 0), (1, 1), 2, 2],
                 [(0, 0), (1, 0), (2, 0), (2, 1), 2, 3],
                 [(0, 2), (1, 0), (1, 1), (1, 2), 3, 2],
                 [(0, 0), (0, 1), (1, 1), (2, 1), 2, 3],
                 [(0, 0), (0, 1), (0, 2), (1, 0), 3, 2],
                 [(0, 0), (0, 1), (1, 0), (2, 0), 2, 3],
                 [(0, 0), (0, 1), (0, 2), (1, 2), 3, 2],
                 [(0, 1), (1, 1), (2, 0), (2, 1), 2, 3],
                 [(0, 0), (1, 0), (1, 1), (1, 2), 3, 2],
                 [(0, 0), (1, 0), (1, 1), (2, 1), 2, 3],
                 [(0, 1), (0, 2), (1, 0), (1, 1), 3, 2],
                 [(0, 1), (1, 0), (1, 1), (2, 0), 2, 3],
                 [(0, 0), (0, 1), (1, 1), (1, 2), 3, 2],
                 [(0, 0), (0, 1), (0, 2), (1, 1), 3, 2],
                 [(0, 0), (1, 0), (2, 0), (1, 1), 2, 3],
                 [(0, 1), (1, 0), (1, 1), (2, 1), 2, 3],
                 [(0, 1), (1, 0), (1, 1), (1, 2), 3, 2]
                 ]

answer = -1

for tet in tet_list:
    positions = tet[0:4]
    ga = tet[4]
    se = tet[5]

    for i in range(0, M - ga + 1):
        for j in range(0, N - se + 1):
            new_position = []
            for pos in positions:   # pos = (1, 0) 같은거
                new_pos = (pos[0] + j, pos[1] + i)
                new_position.append(new_pos)

            # new_position 바탕으로 합계 구하기
            new_sum = 0
            for pos in new_position:
                new_sum += ground[pos[0]][pos[1]]

            answer = max(new_sum, answer)


print(answer)
